---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyKeywordProtected
source: html/880beb6b-0c2b-d899-62f4-4440cb6f4b0c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyKeywordProtected Property

"Content protection enabled"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyKeywordProtected { get; }
```